Revit 2024 API
ConnectionValidationWarning Properties
The ConnectionValidationWarning type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Reason
 Enumeration for reason of warning.
Resolution
 Enumeration for resolution that was applied.
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace